trade_exp/src/DataProcessors/РабочееМестоПоДоставкеОтПоставщика/РабочееМестоПоДоставкеОтПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РабочееМестоПоДоставкеОтПоставщика</name>
</mdclass:DataProcessor>

trade_exp/src/AccumulationRegisters/ЗаказыКДоставкеОтПоставщика/ЗаказыКДоставкеОтПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="50a3f077-bb00-4b3c-b903-1f8e8c12863e">
  <name>ЗаказыКДоставкеОтПоставщика</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="e8c86484-2d9c-456e-9712-89af750bfba4">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="187706c0-aafe-470e-8971-fbe20c0f1360">
    <name>ЗаказНаДоставку</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="ec5f0146-6d60-4055-83fd-72118391b753">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/Documents/ЗаказНаДоставкуОтПоставщика/ЗаказНаДоставкуОтПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЗаказНаДоставкуОтПоставщика</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="9108def1-74b6-49f6-826d-411b4f378a62">
    <name>Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bf2dbe71-1e2e-44dd-8f86-3a17b80c2b50">
    <name>ПрибытиеНаВыгрузку</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="80353671-e282-4b56-8dce-2a57668ab838">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dfe24e2d-676b-48a5-a9b8-3c5f0b13acc6">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="455e72aa-afaf-45cd-9f49-31780b117de1">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="88892e7e-ed4c-4ff9-9e78-07befff4e04a">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9a2e9879-cef7-42dd-905f-482b6a2f455a">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="86982b60-862a-4887-ba01-a08bc79f03c6">
    <name>ТипУпаковки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>16</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f108f560-b4a5-4574-bd00-9c07fe772f24">
    <name>СтоимостьДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9430bac8-9a15-40d7-aa10-3adfdb59c859">
    <name>ТранзитФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fcf9d9ba-0906-4ffc-9e5e-737f64099517">
    <name>ПрибытиеНаПогрузку</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d780eac6-c9c8-4c2f-852c-10736a66bfd6">
    <name>ИнтервалНаПогрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2044c9b2-8129-4e36-9f45-71da4032cde7">
    <name>ВремяНаПогрузкеС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="735e0970-9985-412c-a81f-2c90d6cb07d3">
    <name>МаксимальнаяДлина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c7b12af0-6c5d-49b7-a923-925de351a6bf">
    <name>НаименованиеГруза</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0258e270-c945-45b7-9b29-400d7f52e81c">
    <name>ВремяНаВыгрузкеС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="eb5d3130-09a9-492d-b99b-014e0a261c51">
    <name>ВремяНаПогрузкеПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0143b187-4422-4fe8-969a-7ba96e241605">
    <name>АдресНаПогрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f56e03a7-c4af-4ed3-b43a-e18714951dd2">
    <name>ТелефонНаПогрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="52d79523-9883-43fe-aed3-302fe7eb6ebe">
    <name>ИнтервалНаВыгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0c0375cd-d0c9-4885-97e6-dfa91b0458f7">
    <name>ВремяНаВыгрузкеПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="fe254e26-2b30-4311-a001-839a5b565611">
    <name>КоличествоМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c30b0ea6-027c-49fa-8637-dc11fd260b8c">
    <name>КонтрагентКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d40ac935-ba6c-4dfc-95dc-42dd2c509023">
    <name>ФилиалВыгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="84a4d445-3c12-4ced-b011-00a1d0cc5f10">
    <name>АдресНаВыгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="fe589a13-9652-4e80-a67c-daaecc2e76dc">
    <name>ТелефонНаВыгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="03649d03-61d7-4d00-aad8-b57d6b16b8cc">
    <name>СсылкаБитрикс</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7fb39d2e-07c5-4a8e-91cd-fbeecd9241ff">
    <name>Транзит</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ec493491-1e4b-4c54-afa5-c6540c966861">
    <name>СтоимостьТовара</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2a47fe91-e454-4a30-948a-b860a45251f9">
    <name>НаправлениеДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7b68ea76-f8ba-4e00-a6e6-0bfa3d88a69d">
    <name>ДоверенностьНаСумму</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="331761b3-207b-4f40-b3a4-cfa35eae35cb">
    <name>Вес</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3eeb0f84-a6a0-44ea-bc0e-3a7c773ae588">
    <name>Объем</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="dbf76a4e-cc67-4e12-871f-a782770ccfd1">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c16b4556-8131-40e1-b044-7e7acc8ab2d6">
    <name>КоличествоДнейНаВывозЗаказа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="481ac138-6530-4efd-abc8-d5cb7f871411">
    <name>ПоДокументу</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="a848cef6-15c4-4d0f-8f9f-3ccb4cf548c2">
    <name>Основания</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="bae39f0f-a7b4-46fc-afc5-0fc2017cb0ee">
      <name>Документ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/DataProcessors/РабочееМестоПоДоставкеОтПоставщика/Forms/Форма/Module.bsl
#Область СобытияФормы

&НаКлиенте
Процедура ИсключитьГрузы(Команда)
	СтандартнаяОбработка = Ложь;
	ПараметрыОткрытия 	 = Новый Структура;
	ПараметрыОткрытия.Вставить("НаименованиеГрузов", НаименованияДляИсключения);
	ОбработкаВыбораИсключенийГруза = Новый ОписаниеОповещения("ОбработкаВыбораИсключенийГруза", ЭтаФорма);
	ОткрытьФорму("Обработка.РабочееМестоПоДоставкеОтПоставщика.Форма.ФормаИсключенияГрузов", ПараметрыОткрытия, ЭтаФорма,,,, ОбработкаВыбораИсключенийГруза, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораИсключенийГруза(Результат, ДопПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		ОбработкаВыбораИсключенийГрузаСервер(Результат);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораИсключенийГрузаСервер(Результат)
	    СвернутаяТаблицаИсключений = СвернутьТаблицуИсключений(Результат.Выгрузить());
		НаименованияДляИсключения.Загрузить(СвернутаяТаблицаИсключений);
		ОбновитьСписокДоставкиНаСервере();	 
КонецПроцедуры

Функция СвернутьТаблицуИсключений(ИсходнаяТаблица)
	ИсходнаяТаблица.Свернуть("Наименование");
	Отбор = Новый Структура("Наименование","");
	МассивПустыхСтрок = ИсходнаяТаблица.НайтиСтроки(Отбор);
	Для Каждого СтрокаМассива из МассивПустыхСтрок Цикл
    	ИсходнаяТаблица.Удалить(СтрокаМассива);
	КонецЦикла;
	Возврат ИсходнаяТаблица; 
КонецФункции
	
&НаСервере
Функция СформироватьТекстОтбораИсключенийГруза()
	ТаблицаИсключений = НаименованияДляИсключения.Выгрузить();
	Если ТаблицаИсключений.Количество() > 0 Тогда
   	 ТекстОтбора = "";
		Для Каждого Строка Из ТаблицаИсключений Цикл
			ТекстОтбора = ТекстОтбора + " Не Пулл.ЗаказНаДоставку.НаименованиеГруза ПОДОБНО ""%" + Строка.Наименование + "%"" И";
		КонецЦикла;
		ТекстОтбора = Лев(ТекстОтбора, СтрДлина(ТекстОтбора)-1);
		Возврат ТекстОтбора;
	Иначе	
		Возврат "ИСТИНА";
	КонецЕсли
КонецФункции	

&НаСервере
Процедура Инициализировать()
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Основания, "МассивДокументов", Документы.РеализацияТоваровУслуг.ПустаяСсылка(), Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТоварОснований, "Основания", Документы.РеализацияТоваровУслуг.ПустаяСсылка(), Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Период.ДатаНачала= НачалоМесяца(ТекущаяДата());
	Период.ДатаОкончания= КонецМесяца(ТекущаяДата());
	
	Карта= Истина;
	УстановитьВидимостьДоступность();
	ИнициализироватьКарту();
КонецПроцедуры

&НаКлиенте
Процедура ПулЗаказовПриАктивизацииСтроки(Элемент)
	ТекущаяСтрока= Элементы.ПулЗаказов.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Основания, "МассивДокументов", ПолучитьМассивОснования(ТекущаяСтрока.ЗаказНаДоставку), Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТоварОснований, "Основания", ПолучитьМассивОснования(ТекущаяСтрока.ЗаказНаДоставку), Истина);
	Иначе
		Инициализировать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОснованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьЗначение(Элемент.ТекущиеДанные.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПулЗаказовОтметкаПриИзменении(Элемент)
	ДобавитьУдалитьЗаказВРейс();
КонецПроцедуры
&НаКлиенте
Процедура ДобавитьУдалитьЗаказВРейс()
	ТекущаяСтрока= Элементы.ПулЗаказов.ТекущиеДанные;
	
	Если ТекущаяСтрока.Отметка Тогда
		НоваяСтрока= ЗаказыВРейс.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		НоваяСтрока.НомерСтроки= ЗаказыВРейс.Количество();
		
	Иначе
		Строки= ЗаказыВРейс.НайтиСтроки(Новый Структура ("ЗаказНаДоставку", ТекущаяСтрока.ЗаказНаДоставку));
		Для Каждого Строка Из Строки Цикл
			ЗаказыВРейс.Удалить(ЗаказыВРейс.Индекс(Строка));
		КонецЦикла;
		
	КонецЕсли;
	РасчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура КартаПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры

#КонецОбласти


#Область КомандыИСобытия

&НаКлиенте
Процедура ОбновитьСписокДоставки(Команда)
	ОбновитьСписокДоставкиНаСервере();
	ЗаказыВРейс.Очистить();
КонецПроцедуры
&НаСервере
Процедура ОбновитьСписокДоставкиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыКДоставкеОтПоставщикаОстатки.ЗаказНаДоставку КАК ЗаказНаДоставку,
	|	СУММА(ЗаказыКДоставкеОтПоставщикаОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ Пулл
	|ИЗ
	|	РегистрНакопления.ЗаказыКДоставкеОтПоставщика.Остатки(, ) КАК ЗаказыКДоставкеОтПоставщикаОстатки
	|ГДЕ
	|	ЗаказыКДоставкеОтПоставщикаОстатки.КоличествоОстаток > 0
	|	И ЗаказыКДоставкеОтПоставщикаОстатки.ЗаказНаДоставку.Подразделение = &Подразделение
	|	И ЗаказыКДоставкеОтПоставщикаОстатки.ЗаказНаДоставку.ПрибытиеНаПогрузку МЕЖДУ &Дата1 И &Дата2
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыКДоставкеОтПоставщикаОстатки.ЗаказНаДоставку
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Пулл.ЗаказНаДоставку КАК ЗаказНаДоставку,
	|	Пулл.ЗаказНаДоставку.ПрибытиеНаВыгрузку КАК ПрибытиеНаВыгрузку,
	|	Пулл.ЗаказНаДоставку.ПрибытиеНаПогрузку КАК ПрибытиеНаПогрузку,
	|	Пулл.ЗаказНаДоставку.АдресНаВыгрузке КАК АдресНаВыгрузке,
	|	Пулл.ЗаказНаДоставку.АдресНаПогрузке КАК АдресНаПогрузке,
	|	Пулл.ЗаказНаДоставку.Вес КАК Вес,
	|	Пулл.ЗаказНаДоставку.Объем КАК Объем,
	|	Пулл.ЗаказНаДоставку.НаправлениеДоставки КАК НаправлениеДоставки,
	|	Пулл.ЗаказНаДоставку.МаксимальнаяДлина КАК МаксимальнаяДлина,
	|	Пулл.ЗаказНаДоставку.Широта КАК Широта,
	|	Пулл.ЗаказНаДоставку.Долгота КАК Долгота,
	|	Пулл.ЗаказНаДоставку.Транзит КАК Транзит,
	|	Пулл.ЗаказНаДоставку.КоличествоМест КАК КоличествоМест,
	|	Пулл.ЗаказНаДоставку.ТипУпаковки КАК ТипУпаковки,
	|	Пулл.ЗаказНаДоставку.НаименованиеГруза КАК НаименованиеГруза
	|ИЗ
	|	Пулл КАК Пулл";
	
	Запрос.УстановитьПараметр("Дата1", Период.ДатаНачала);
	Запрос.УстановитьПараметр("Дата2", Период.ДатаОкончания);
		
	Если ЗначениеЗаполнено(Филиал) Тогда
		Запрос.УстановитьПараметр("Подразделение", Филиал);
	Иначе
		Запрос.Текст= СтрЗаменить(Запрос.Текст, "И ЗаказыКДоставкеОтПоставщикаОстатки.ЗаказНаДоставку.Подразделение = &Подразделение", "");
	КонецЕсли;
		Запрос.Текст= СтрЗаменить(Запрос.Текст, "КАК Пулл", "КАК Пулл ГДЕ " + СформироватьТекстОтбораИсключенийГруза());
	РезультатЗапроса = Запрос.Выполнить();
	ПулЗаказов.Загрузить(РезультатЗапроса.Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ФилиалПриИзменении(Элемент)
	  ОчиститьКарту(Неопределено);
КонецПроцедуры
#КонецОбласти

#Область ФункцииОбработки

&НаКлиенте
Процедура ПулЗаказовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка= Ложь;
	Док= Элементы.ПулЗаказов.ТекущиеДанные.ЗаказНаДоставку;
	Если Не Док.Пустая() Тогда 	
		ОткрытьФорму("Документ.ЗаказНаДоставкуОтПоставщика.ФормаОбъекта", Новый Структура("Ключ", Док));
	КонецЕсли;
КонецПроцедуры

Процедура УбратьРасстояние()
	Элементы.Расстояние.Заголовок= "";
	Элементы.Расстояние.Видимость= Ложь;
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивОснования(Ссылка)
	мОснований= Новый Массив;
	Для Каждого стрОснования Из Ссылка.Основания Цикл
		мОснований.Добавить(стрОснования.Документ);
	КонецЦикла;
	Возврат мОснований;
КонецФункции

&НаКлиенте
Процедура РасчитатьИтоги()
	Ном= 1;
	ВесИтог= 0;
	ОбъемИтог= 0;
	МаксимальнаяДлинна= 0;
	Расстояние= 0;
	ВремяВПути= 0;
	ВремяРазгрузки= 0;
	СтоимостьДоставки= 0;
	Для Каждого стрДоставки Из ЗаказыВРейс Цикл
		стрДоставки.НомерСтроки= Ном;
		Ном= Ном+1;
		ВесИтог= ВесИтог+стрДоставки.Вес;
		ОбъемИтог= ОбъемИтог+стрДоставки.Объем;
		МаксимальнаяДлинна= Макс(МаксимальнаяДлинна, стрДоставки.МаксимальнаяДлина);
		Расстояние= Расстояние+стрДоставки.Расстояние;
		ВремяВПути= ВремяВПути+стрДоставки.ВремяВПути;
		ВремяРазгрузки= ВремяРазгрузки+стрДоставки.ВремяРазгрузки;
		СтоимостьДоставки= СтоимостьДоставки+стрДоставки.СтоимостьДоставки;
	КонецЦикла;
	Элементы.ЗаказыВРейсыВес.ТекстПодвала= ВесИтог;
	Элементы.ЗаказыВРейсыОбъем.ТекстПодвала= ОбъемИтог;
	Элементы.ЗаказыВРейсыМаксимальнаяДлина.ТекстПодвала= МаксимальнаяДлинна;
	Элементы.ЗаказыВРейсыРасстояние.ТекстПодвала= Расстояние;
	Элементы.ЗаказыВРейсыВремяВПути.ТекстПодвала= ВремяВПути;
	Элементы.ЗаказыВРейсыВремяРазгрузки.ТекстПодвала= ВремяРазгрузки;
	Элементы.ЗаказыВРейсСтоимостьДоставки.ТекстПодвала= СтоимостьДоставки;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	Если Карта Тогда 
		Элементы.ГруппаПраво.Видимость= Истина;
		Элементы.ЗаказыВРейсПостроитьМаршрутRoute.Видимость= Истина;
	Иначе
		Элементы.ГруппаПраво.Видимость= Ложь;
		Элементы.ЗаказыВРейсПостроитьМаршрутRoute.Видимость= Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОформитьДокументы

&НаКлиенте
Процедура СоздатьРейс(Команда)
	СоздатьРейсНаКлиенте(ЗаказыВРейс);
КонецПроцедуры
&НаКлиенте
Процедура СоздатьРейсНаКлиенте(ТаблицаДоставки)
	мОснований= Новый Массив;
	Для Каждого Доставка Из ТаблицаДоставки Цикл
		мОснований.Добавить(Доставка.ЗаказНаДоставку);
	КонецЦикла;	
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание", мОснований);
	
	ОткрытьФорму("Документ.РейсОтПоставщика.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры


&НаКлиенте
Процедура ЗаказыВРейсыПриИзменении(Элемент)
	РасчитатьИтоги();
КонецПроцедуры
#КонецОбласти

#Область КАРТА
#Область СобытияКарты
&НаКлиенте
Процедура КартаЯндексПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)//Не исползуем
	Координаты= ГеокодированиеКлиент.ПолучитьКоординатыТочки(Элементы.КартаЯндекс);
	Координаты= ГеокодированиеКлиент.ПолучитьАдресПоКоординатам(Координаты.Широта, Координаты.Долгота);
КонецПроцедуры

&НаКлиенте
Процедура Домой(Команда)
	ГеокодированиеКлиент.Домой(Элементы.КартаЯндекс, Филиал);
	УбратьРасстояние();
КонецПроцедуры

&НаКлиенте
Процедура НайтиАдресНаКарте(Команда)
	Если не ПустаяСтрока(СтрокаПоиска) Тогда
		ГеокодированиеКлиент.ПоискАдресаНаКарте(Элементы.КартаЯндекс, СтрокаПоиска);
		Координаты= ГеокодированиеКлиент.ПолучитьКоординатыПоАдресу(СтрокаПоиска);
		УбратьРасстояние();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКарту(Команда)
	ИнициализироватьКарту();
	УбратьРасстояние();
КонецПроцедуры

&НаКлиенте
Процедура ПостроитьМаршрутRoute(Команда)
	ПараметрыМаршрута = ПолучитьМассивАдресов(ЗаказыВРейс);
	
	Элементы.КартаЯндекс.document.getElementById("WebClientOperation").value = "calcRouterPostavki(" + ПараметрыМаршрута + ")";
	Элементы.КартаЯндекс.document.getElementById("WebClient").click();
КонецПроцедуры


&НаКлиенте
Процедура ПолучитьРасстояние(Команда)
	стрДистанция= Элементы.КартаЯндекс.document.getElementById("routeInfo").value;
	Если Не ПустаяСтрока(стрДистанция) Тогда
		мДистанций= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(стрДистанция, ";", Истина, Истина);
		
		Для Инд = 0 По ЗаказыВРейс.Количество() - 1 Цикл
			ТекСтрока= ЗаказыВРейс[Инд];
			Попытка
				ТекСтрока.Расстояние= Число(мДистанций[Инд])/1000;
			Исключение
				ТекСтрока.Расстояние= 0;
			КонецПопытки;
		КонецЦикла;
		РасчитатьИтоги();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ИнициализацияКарты

&НаКлиенте
Процедура ИнициализироватьКарту()
	КартаЯндекс= "";
	КартаЯндекс= ПолучитьТекстМакета();
	
	ГеокодированиеКлиент.УстановитьНачальныеКоординаты(Филиал, КартаЯндекс);
КонецПроцедуры
&НаСервере
Функция ПолучитьТекстМакета()
	Макет= ПолучитьОбщийМакет("МакетЯндексКарты");
	стрМакет = Макет.ПолучитьТекст();
	
	Документы.ЗаказНаДоставкуОтПоставщика.УбратьПодстановкиИзКода(стрМакет);	

	Возврат стрМакет;
КонецФункции

#КонецОбласти


#Область Геокодирование
&НаКлиенте
Функция ПолучитьМассивАдресов(ТаблицаТочек)
	
	Результат = "[""";
	
	Для Ин = 0 По ТаблицаТочек.Количество() - 1 Цикл
		Результат = Результат + ТаблицаТочек[ин].АдресНаПогрузке + """,""";
	КонецЦикла;
	
	Результат= Результат +  ТаблицаТочек[ТаблицаТочек.Количество()-1].АдресНаВыгрузке + """]";
	
	Возврат Результат;
КонецФункции

#КонецОбласти
#КонецОбласти
